# Proceso de ETL - Proyecto 1 Ciencia de datos
Sebastián Gómez - 2259474 <br>
Stiven Henao - 2259603 <br>
Víctor Hernández - 2259520 <br>

In [32]:
import pandas as pd

## Cargo los datos en un data frame

In [33]:
data_frame = pd.read_csv('customer_shopping_data.csv')
data_frame.head(2)

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul

## Primero analizamos los datos que tenemos

In [34]:
data_frame.info()
data_frame.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99457 entries, 0 to 99456
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_no      99457 non-null  object
 1   customer_id     99457 non-null  object
 2   gender          99457 non-null  object
 3   age             99457 non-null  int64
 4   category        99457 non-null  object
 5   quantity        99457 non-null  int64
 6   price           99457 non-null  float64
 7   payment_method  99457 non-null  object
 8   invoice_date    99457 non-null  object
 9   shopping_mall   99457 non-null  object
dtypes: float64(1), int64(2), object(7)
memory usage: 7.6+ MB

                age      quantity         price
count  99457.000000  99457.000000  99457.000000
mean      43.427089      3.003429    689.256321
std       14.990054      1.413025    941.184567
min       18.000000      1.000000      5.230000
25%       30.000000      2.000000     45.450000
50%       43.000000      3.000000    203.300000
75%       56.000000      4.000000   1200.320000
max       69.000000      5.000000   5250.000000

### Cambiamos el formato de fecha de Object a Datetime para trabajarlo mejor

In [35]:
data_frame['invoice_date'] = pd.to_datetime(data_frame['invoice_date'], format='%d/%m/%Y')
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99457 entries, 0 to 99456
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_no      99457 non-null  object
 1   customer_id     99457 non-null  object
 2   gender          99457 non-null  object
 3   age             99457 non-null  int64
 4   category        99457 non-null  object
 5   quantity        99457 non-null  int64
 6   price           99457 non-null  float64
 7   payment_method  99457 non-null  object
 8   invoice_date    99457 non-null  datetime64[ns]
 9   shopping_mall   99457 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(6)
memory usage: 7.6+ MB

In [36]:
data_frame.columns

Index(['invoice_no', 'customer_id', 'gender', 'age', 'category', 'quantity',
       'price', 'payment_method', 'invoice_date', 'shopping_mall'],
      dtype='object')

### No encontramos otra alguna irregularidad, ademas los nombres de las columnas tienen un formato que nos permite trabajar mejor con ellas en el proceso de transformación. Por tanto no necesitamos formateo de nombres.

## Verificamos datos duplicados, principalmente en cuanto a el numero de factura.

In [37]:
data_frame[data_frame.duplicated(subset='invoice_no')]

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

In [38]:
df_star = data_frame.copy()
df_star.head(5)

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon

### Una vez analizado y formateado los datos, vamos a realizar el proceso transformarlo a modelo estrella siguiendo la estructura que definimos para la bodega de datos.

Primero Agregamos una nueva columna a la factura la cual hace referencia al precio total de la misma.

In [39]:
df_star['total_price'] = df_star['quantity'] * df_star['price']
df_star.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,total_price
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon,7502.00
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul,5401.53
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity,300.08
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM,15004.25
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon,242.40

### Ahora comenzamos por crear la dimensión de producto a partir de la tabla de hechos que sera la de factura, comenzando por agregar un id a cada producto.

In [40]:
dim_product = df_star[['invoice_no','category', 'price']].copy()
dim_product = dim_product[['category', 'price']].drop_duplicates()
dim_product['name'] = ''
dim_product['product_id'] = range(1, len(dim_product) + 1)
dim_product

            category    price name  product_id
0           Clothing  1500.40                1
1              Shoes  1800.51                2
2           Clothing   300.08                3
3              Shoes  3000.85                4
4              Books    60.60                5
6          Cosmetics    40.66                6
7           Clothing   600.16                7
8           Clothing   900.24                8
10   Food & Beverage    10.46                9
11             Books    15.15               10
12              Toys   143.36               11
16             Books    30.30               12
17   Food & Beverage    15.69               13
21   Food & Beverage     5.23               14
23        Technology  5250.00               15
24             Books    75.75               16
25              Toys    71.68               17
26         Cosmetics   203.30               18
27             Shoes  2400.68               19
29         Cosmetics   121.98               20
30              Toys   107.52               21
33          Clothing  1200.32               22
41         Cosmetics    81.32               23
51             Books    45.45               24
53        Technology  4200.00               25
64         Cosmetics   162.64               26
67          Souvenir    58.65               27
72   Food & Beverage    26.15               28
75          Souvenir    35.19               29
79   Food & Beverage    20.92               30
82          Souvenir    23.46               31
90        Technology  2100.00               32
91              Toys    35.84               33
100       Technology  3150.00               34
124             Toys   179.20               35
169            Shoes   600.17               36
233       Technology  1050.00               37
238            Shoes  1200.34               38
270         Souvenir    46.92               39
288         Souvenir    11.73               40

### Posteriormente combinamos ambas tablas para poder tener el id de producto en la principal y eliminamos las columnas que ya no son necesarios en la tabla de factura y en la dimensión de producto.

In [41]:
df_star = df_star.merge(dim_product, on=['category', 'price'], how='left')
df_star

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,total_price,name,product_id
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon,7502.00,,1
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul,5401.53,,2
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity,300.08,,3
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM,15004.25,,4
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon,242.40,,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,2022-09-21,Kanyon,293.25,,27
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,2021-09-22,Forum Istanbul,20.92,,9
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,2021-03-28,Metrocity,20.92,,9
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,2021-03-16,Istinye Park,16800.00,,25
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,2022-10-15,Mall of Istanbul,105.57,,29

In [42]:
df_star = df_star.drop(columns=['category', 'price', 'name'])
df_star

,invoice_no,customer_id,gender,age,quantity,payment_method,invoice_date,shopping_mall,total_price,product_id
0,I138884,C241288,Female,28,5,Credit Card,2022-08-05,Kanyon,7502.00,1
1,I317333,C111565,Male,21,3,Debit Card,2021-12-12,Forum Istanbul,5401.53,2
2,I127801,C266599,Male,20,1,Cash,2021-11-09,Metrocity,300.08,3
3,I173702,C988172,Female,66,5,Credit Card,2021-05-16,Metropol AVM,15004.25,4
4,I337046,C189076,Female,53,4,Cash,2021-10-24,Kanyon,242.40,5
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,5,Credit Card,2022-09-21,Kanyon,293.25,27
99453,I325143,C569580,Male,27,2,Cash,2021-09-22,Forum Istanbul,20.92,9
99454,I824010,C103292,Male,63,2,Debit Card,2021-03-28,Metrocity,20.92,9
99455,I702964,C800631,Male,56,4,Cash,2021-03-16,Istinye Park,16800.00,25
99456,I232867,C273973,Female,36,3,Credit Card,2022-10-15,Mall of Istanbul,105.57,29

### Repetimos el proceso anterior para la dimensión de Clientes

In [43]:
dim_customer = df_star[['customer_id', 'gender', 'age']].copy()
dim_customer = dim_customer.drop_duplicates()
dim_customer['name'] = ''
dim_customer

      customer_id  gender  age name
0         C241288  Female   28
1         C111565    Male   21
2         C266599    Male   20
3         C988172  Female   66
4         C189076  Female   53
...           ...     ...  ...  ...
99452     C441542  Female   45
99453     C569580    Male   27
99454     C103292    Male   63
99455     C800631    Male   56
99456     C273973  Female   36

[99457 rows x 4 columns]

In [44]:
df_star = df_star.drop(columns=['gender', 'age'])
df_star

,invoice_no,customer_id,quantity,payment_method,invoice_date,shopping_mall,total_price,product_id
0,I138884,C241288,5,Credit Card,2022-08-05,Kanyon,7502.00,1
1,I317333,C111565,3,Debit Card,2021-12-12,Forum Istanbul,5401.53,2
2,I127801,C266599,1,Cash,2021-11-09,Metrocity,300.08,3
3,I173702,C988172,5,Credit Card,2021-05-16,Metropol AVM,15004.25,4
4,I337046,C189076,4,Cash,2021-10-24,Kanyon,242.40,5
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,Credit Card,2022-09-21,Kanyon,293.25,27
99453,I325143,C569580,2,Cash,2021-09-22,Forum Istanbul,20.92,9
99454,I824010,C103292,2,Debit Card,2021-03-28,Metrocity,20.92,9
99455,I702964,C800631,4,Cash,2021-03-16,Istinye Park,16800.00,25
99456,I232867,C273973,3,Credit Card,2022-10-15,Mall of Istanbul,105.57,29

### Ahora para la dimensión de las tiendas.

In [45]:
dim_shopping_mall = df_star[['shopping_mall']].copy()
dim_shopping_mall = dim_shopping_mall.drop_duplicates()
dim_shopping_mall['shopping_mall_id'] = range(1, len(dim_shopping_mall) + 1)
dim_shopping_mall

        shopping_mall  shopping_mall_id
0              Kanyon                 1
1      Forum Istanbul                 2
2           Metrocity                 3
3        Metropol AVM                 4
6        Istinye Park                 5
7    Mall of Istanbul                 6
11  Emaar Square Mall                 7
13        Cevahir AVM                 8
15     Viaport Outlet                 9
17       Zorlu Center                10

In [46]:
df_star = df_star.merge(dim_shopping_mall, on='shopping_mall', how='left')
df_star

,invoice_no,customer_id,quantity,payment_method,invoice_date,shopping_mall,total_price,product_id,shopping_mall_id
0,I138884,C241288,5,Credit Card,2022-08-05,Kanyon,7502.00,1,1
1,I317333,C111565,3,Debit Card,2021-12-12,Forum Istanbul,5401.53,2,2
2,I127801,C266599,1,Cash,2021-11-09,Metrocity,300.08,3,3
3,I173702,C988172,5,Credit Card,2021-05-16,Metropol AVM,15004.25,4,4
4,I337046,C189076,4,Cash,2021-10-24,Kanyon,242.40,5,1
...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,Credit Card,2022-09-21,Kanyon,293.25,27,1
99453,I325143,C569580,2,Cash,2021-09-22,Forum Istanbul,20.92,9,2
99454,I824010,C103292,2,Debit Card,2021-03-28,Metrocity,20.92,9,3
99455,I702964,C800631,4,Cash,2021-03-16,Istinye Park,16800.00,25,5
99456,I232867,C273973,3,Credit Card,2022-10-15,Mall of Istanbul,105.57,29,6

In [47]:
df_star = df_star.drop(columns=['shopping_mall'])
df_star

,invoice_no,customer_id,quantity,payment_method,invoice_date,total_price,product_id,shopping_mall_id
0,I138884,C241288,5,Credit Card,2022-08-05,7502.00,1,1
1,I317333,C111565,3,Debit Card,2021-12-12,5401.53,2,2
2,I127801,C266599,1,Cash,2021-11-09,300.08,3,3
3,I173702,C988172,5,Credit Card,2021-05-16,15004.25,4,4
4,I337046,C189076,4,Cash,2021-10-24,242.40,5,1
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,Credit Card,2022-09-21,293.25,27,1
99453,I325143,C569580,2,Cash,2021-09-22,20.92,9,2
99454,I824010,C103292,2,Debit Card,2021-03-28,20.92,9,3
99455,I702964,C800631,4,Cash,2021-03-16,16800.00,25,5
99456,I232867,C273973,3,Credit Card,2022-10-15,105.57,29,6

### Ahora para la dimensión de metodos de pago.

In [48]:
dim_payment_method = df_star[['payment_method']].copy()
dim_payment_method = dim_payment_method.drop_duplicates()
dim_payment_method['payment_method_id'] = range(1, len(dim_payment_method) + 1)
dim_payment_method

  payment_method  payment_method_id
0    Credit Card                  1
1     Debit Card                  2
2           Cash                  3

In [49]:
df_star = df_star.merge(dim_payment_method, on='payment_method', how='left')
df_star

,invoice_no,customer_id,quantity,payment_method,invoice_date,total_price,product_id,shopping_mall_id,payment_method_id
0,I138884,C241288,5,Credit Card,2022-08-05,7502.00,1,1,1
1,I317333,C111565,3,Debit Card,2021-12-12,5401.53,2,2,2
2,I127801,C266599,1,Cash,2021-11-09,300.08,3,3,3
3,I173702,C988172,5,Credit Card,2021-05-16,15004.25,4,4,1
4,I337046,C189076,4,Cash,2021-10-24,242.40,5,1,3
...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,Credit Card,2022-09-21,293.25,27,1,1
99453,I325143,C569580,2,Cash,2021-09-22,20.92,9,2,3
99454,I824010,C103292,2,Debit Card,2021-03-28,20.92,9,3,2
99455,I702964,C800631,4,Cash,2021-03-16,16800.00,25,5,3
99456,I232867,C273973,3,Credit Card,2022-10-15,105.57,29,6,1

In [50]:
df_star = df_star.drop(columns=['payment_method'])
df_star

,invoice_no,customer_id,quantity,invoice_date,total_price,product_id,shopping_mall_id,payment_method_id
0,I138884,C241288,5,2022-08-05,7502.00,1,1,1
1,I317333,C111565,3,2021-12-12,5401.53,2,2,2
2,I127801,C266599,1,2021-11-09,300.08,3,3,3
3,I173702,C988172,5,2021-05-16,15004.25,4,4,1
4,I337046,C189076,4,2021-10-24,242.40,5,1,3
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,2022-09-21,293.25,27,1,1
99453,I325143,C569580,2,2021-09-22,20.92,9,2,3
99454,I824010,C103292,2,2021-03-28,20.92,9,3,2
99455,I702964,C800631,4,2021-03-16,16800.00,25,5,3
99456,I232867,C273973,3,2022-10-15,105.57,29,6,1

### Por último para la dimensión de fecha hicimos el siguiente proceso
Inicialmente gracias a que el tipo de dato de la fecha fue transformado a datetime, podemos extraer el dia, mes y año. Con lo anterior creamos los campos necesarios.

In [51]:
dim_date = df_star[['invoice_date']].copy()
dim_date = dim_date.drop_duplicates()
dim_date['day'] = dim_date['invoice_date'].dt.day
dim_date['month'] = dim_date['invoice_date'].dt.month
dim_date['year'] = dim_date['invoice_date'].dt.year
dim_date['date_id'] = range(1, len(dim_date) + 1)
dim_date

     invoice_date  day  month  year  date_id
0      2022-08-05    5      8  2022        1
1      2021-12-12   12     12  2021        2
2      2021-11-09    9     11  2021        3
3      2021-05-16   16      5  2021        4
4      2021-10-24   24     10  2021        5
...           ...  ...    ...   ...      ...
4220   2021-01-29   29      1  2021      793
4296   2021-01-01    1      1  2021      794
4491   2021-08-12   12      8  2021      795
4505   2022-01-08    8      1  2022      796
5173   2021-05-11   11      5  2021      797

[797 rows x 5 columns]

In [52]:
df_star = df_star.merge(dim_date, on='invoice_date', how='left')
df_star

,invoice_no,customer_id,quantity,invoice_date,total_price,product_id,shopping_mall_id,payment_method_id,day,month,year,date_id
0,I138884,C241288,5,2022-08-05,7502.00,1,1,1,5,8,2022,1
1,I317333,C111565,3,2021-12-12,5401.53,2,2,2,12,12,2021,2
2,I127801,C266599,1,2021-11-09,300.08,3,3,3,9,11,2021,3
3,I173702,C988172,5,2021-05-16,15004.25,4,4,1,16,5,2021,4
4,I337046,C189076,4,2021-10-24,242.40,5,1,3,24,10,2021,5
...,...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,2022-09-21,293.25,27,1,1,21,9,2022,103
99453,I325143,C569580,2,2021-09-22,20.92,9,2,3,22,9,2021,423
99454,I824010,C103292,2,2021-03-28,20.92,9,3,2,28,3,2021,164
99455,I702964,C800631,4,2021-03-16,16800.00,25,5,3,16,3,2021,544
99456,I232867,C273973,3,2022-10-15,105.57,29,6,1,15,10,2022,83

In [53]:
df_star = df_star.drop(columns=['invoice_date', 'day', 'month', 'year'])
df_star

,invoice_no,customer_id,quantity,total_price,product_id,shopping_mall_id,payment_method_id,date_id
0,I138884,C241288,5,7502.00,1,1,1,1
1,I317333,C111565,3,5401.53,2,2,2,2
2,I127801,C266599,1,300.08,3,3,3,3
3,I173702,C988172,5,15004.25,4,4,1,4
4,I337046,C189076,4,242.40,5,1,3,5
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,293.25,27,1,1,103
99453,I325143,C569580,2,20.92,9,2,3,423
99454,I824010,C103292,2,20.92,9,3,2,164
99455,I702964,C800631,4,16800.00,25,5,3,544
99456,I232867,C273973,3,105.57,29,6,1,83

In [54]:
dim_date = dim_date.drop(columns=['invoice_date'])
dim_date

      day  month  year  date_id
0       5      8  2022        1
1      12     12  2021        2
2       9     11  2021        3
3      16      5  2021        4
4      24     10  2021        5
...   ...    ...   ...      ...
4220   29      1  2021      793
4296    1      1  2021      794
4491   12      8  2021      795
4505    8      1  2022      796
5173   11      5  2021      797

[797 rows x 4 columns]

### Ahora cambiamos los nombres de algunas columnas con la finalidad de ajustarlo a nuestro modelo de bodega de datos para no generar conflictos a la hora de cargar los datos.

In [55]:
dim_payment_method = dim_payment_method.rename(columns={'payment_method': 'type'})
dim_payment_method

          type  payment_method_id
0  Credit Card                  1
1   Debit Card                  2
2         Cash                  3

In [56]:
df_star = df_star.rename(columns={'invoice_no': 'invoice_id', 'date_id': 'invoice_date_id'})
df_star

,invoice_id,customer_id,quantity,total_price,product_id,shopping_mall_id,payment_method_id,invoice_date_id
0,I138884,C241288,5,7502.00,1,1,1,1
1,I317333,C111565,3,5401.53,2,2,2,2
2,I127801,C266599,1,300.08,3,3,3,3
3,I173702,C988172,5,15004.25,4,4,1,4
4,I337046,C189076,4,242.40,5,1,3,5
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,293.25,27,1,1,103
99453,I325143,C569580,2,20.92,9,2,3,423
99454,I824010,C103292,2,20.92,9,3,2,164
99455,I702964,C800631,4,16800.00,25,5,3,544
99456,I232867,C273973,3,105.57,29,6,1,83

In [57]:
dim_date = dim_date.rename(columns={'date_id': 'invoice_date_id'})
dim_date

      day  month  year  invoice_date_id
0       5      8  2022                1
1      12     12  2021                2
2       9     11  2021                3
3      16      5  2021                4
4      24     10  2021                5
...   ...    ...   ...              ...
4220   29      1  2021              793
4296    1      1  2021              794
4491   12      8  2021              795
4505    8      1  2022              796
5173   11      5  2021              797

[797 rows x 4 columns]

In [58]:
dim_shopping_mall = dim_shopping_mall.rename(columns={'shopping_mall': 'name'})
dim_shopping_mall

                 name  shopping_mall_id
0              Kanyon                 1
1      Forum Istanbul                 2
2           Metrocity                 3
3        Metropol AVM                 4
6        Istinye Park                 5
7    Mall of Istanbul                 6
11  Emaar Square Mall                 7
13        Cevahir AVM                 8
15     Viaport Outlet                 9
17       Zorlu Center                10

### Ahora procedemos a cargar los datos en la base de datos con sqlalchemy. Importante que la base de datos ya este creada y su estructura definida con el Script de creación de la base de datos.

In [59]:
from sqlalchemy import create_engine 
engine = create_engine('postgresql://postgres:postgres@localhost:5433/shopping_mall_dw')

In [60]:
dim_customer.to_sql('dim_customer', engine, if_exists='append', index=False)
dim_product.to_sql('dim_product', engine, if_exists='append', index=False)
dim_payment_method.to_sql('dim_payment_method', engine, if_exists='append', index=False)
dim_date.to_sql('dim_date', engine, if_exists='append', index=False)
dim_shopping_mall.to_sql('dim_shopping_mall', engine, if_exists='append', index=False)
df_star.to_sql('invoice', engine, if_exists='append', index=False)

457